app/views/posts/index.html.erb

        <div class="panel-heading pull-right">
          Comments : <%= post.comments.count %> |
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]