app/controllers/posts_controller.rb

  def index
    @posts = params[:q].present? ? current_user.posts.where("title like ? or text like ?","%#{params[:q]}%","%#{params[:q]}%") : current_user.posts
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND (title like '%my%' or text like '%my%')  [["user_id", 1]]

  def create
    @post = current_user.posts.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "text", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "fsdfsdf"], ["text", "<p>sdfsdfsdfsdf</p>"], ["created_at", 2016-12-30 06:41:09 UTC], ["updated_at", 2016-12-30 06:41:09 UTC], ["user_id", 1]]